###############################################################################
# Created by write_sdc
# Wed Dec 28 01:04:08 2022
###############################################################################
current_design soc_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 8.2000 [get_ports {HCLK}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {EXT_IRQ}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[0]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[10]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[11]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[12]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[13]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[14]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[15]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[1]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[2]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[3]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[4]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[5]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[6]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[7]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[8]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOIN_Sys0_S2[9]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {HRESETn}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {MSI_Sys0_SS0_S2}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {MSI_Sys0_SS0_S3}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {NMI}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {RsRx_Sys0_SS0_S0}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {RsRx_Sys0_SS0_S1}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[0]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[10]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[11]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[12]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[13]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[14]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[15]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[16]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[17]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[18]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[19]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[1]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[20]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[21]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[22]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[23]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[2]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[3]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[4]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[5]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[6]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[7]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[8]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SYSTICKCLKDIV[9]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdi_Sys0_S0[0]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdi_Sys0_S0[1]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdi_Sys0_S0[2]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdi_Sys0_S0[3]}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_i_Sys0_SS0_S4}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_i_Sys0_SS0_S5}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_i_Sys0_SS0_S4}]
set_input_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_i_Sys0_SS0_S5}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[0]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[10]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[11]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[12]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[13]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[14]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[15]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[1]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[2]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[3]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[4]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[5]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[6]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[7]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[8]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOEN_Sys0_S2[9]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[0]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[10]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[11]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[12]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[13]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[14]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[15]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[1]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[2]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[3]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[4]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[5]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[6]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[7]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[8]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOOUT_Sys0_S2[9]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[0]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[10]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[11]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[12]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[13]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[14]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[15]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[1]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[2]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[3]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[4]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[5]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[6]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[7]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[8]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPD_Sys0_S2[9]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[0]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[10]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[11]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[12]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[13]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[14]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[15]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[1]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[2]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[3]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[4]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[5]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[6]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[7]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[8]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {GPIOPU_Sys0_S2[9]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {MSO_Sys0_SS0_S2}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {MSO_Sys0_SS0_S3}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {RsTx_Sys0_SS0_S0}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {RsTx_Sys0_SS0_S1}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SCLK_Sys0_SS0_S2}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SCLK_Sys0_SS0_S3}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SSn_Sys0_SS0_S2}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {SSn_Sys0_SS0_S3}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fcen_Sys0_S0}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdo_Sys0_S0[0]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdo_Sys0_S0[1]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdo_Sys0_S0[2]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdo_Sys0_S0[3]}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fdoe_Sys0_S0}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {fsclk_Sys0_S0}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwm_Sys0_SS0_S6}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwm_Sys0_SS0_S7}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_o_Sys0_SS0_S4}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_o_Sys0_SS0_S5}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_oen_o_Sys0_SS0_S4}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {scl_oen_o_Sys0_SS0_S5}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_o_Sys0_SS0_S4}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_o_Sys0_SS0_S5}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_oen_o_Sys0_SS0_S4}]
set_output_delay 0.8200 -clock [get_clocks {core_clock}] -add_delay [get_ports {sda_oen_o_Sys0_SS0_S5}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
